#!/bin/bash

while getopts "nltc" opt
do
    case ${opt} in
        n)  # Извеждане на потребителското име
            echo "Потребителско име: $(whoami)"
            ;;
        l)  # Извеждане на текущата директория
            echo "Текуща директория: $(pwd)"
            ;;
        t)  # Извеждане на текущата дата и час
            echo "Текуща дата и час: $(date +"%Y-%m-%d %H:%M:%S")"
            ;;
        c)  # Извеждане на календара от текущия месец
            echo "Календар за $(date +"%B %Y"):"
            ;;
        *)  # Грешка при невалидна опция
            echo "Invalid argument" >&2
            exit 1
            ;;
    esac
done

